local const = {}

const.EXP = 2.71828182845904523536028747135 -- euler num
const.PI = 3.14159265358979323846264338328 -- const pi
const.HALF_PI = 1.57079632679489661923132169163975209992 -- Pi / 2
const.TWO_PI = 6.28318530717958647692528676655900839968 -- 2 * Pi
const.RADIAN = 57.29577951308232087679815481410514633799
const.DEGREE = 0.01745329251994329576923690768488613444
const.MODES = {
    "Просто рисовалка",
    "Шарики делаем",
    "Квадратики делаем",
    "Наслоение тортиков"
}

return const